// Угадай число.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <ctime>
using namespace std;

int main()
{
	setlocale(LC_ALL,"Russian");
	srand(time(NULL));
	int da = 0;
	int MyValue;
	
	do
	{
		int ComputerValue = rand() % 101;
		cout << "Угадайте число которое загадал компьютер!" << endl;
		int i;
		for (i = 0; i < 5; i++) {
			cin >> MyValue;
			if (ComputerValue > MyValue) {
				cout << "Загаданное число больше " << endl;

			}
			else if (MyValue > ComputerValue) {
				cout << "Загаданное число меньше " << endl;
			}

			else {
				cout << "Поздравляем! Вы угадали! " << endl;
				break;
			}
			if (i == 4) {
				cout << "Вы проиглали! Было загаданно число: " << ComputerValue << endl;
			}
			
		}
		cout << " Хотите начать сначала? (1 - Да, Нет - 2) " << endl;
		cin >> da;
		
	} while (da == 1);


	
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.